app/controllers/items_controller.rb

INSERT INTO `articles` (`title`, `text`, `category_id`, `shipping_charge_id`, `status_id`, `shipping_region_id`, `day_until_shipping_id`, `price`, `user_id`, `created_at`, `updated_at`) VALUES ('テスト', 'テスト', 2, 2, 2, 2, 2, 10000, 1, '2020-08-15 02:49:22.891900', '2020-08-15 02:49:22.891900')
---
  def create
    @article = Article.new(article_params)
    if @article.save

UPDATE `articles` SET `articles`.`updated_at` = '2020-08-15 02:49:22.898840' WHERE `articles`.`id` = 5
---
  def update
    if @article.update(article_params)